Hi,

This is still not working with Terraform 0.12 and unfortunately the above workaround from @alexcallihan doesn't seem to work anymore :(

In a nutshell, I have an ECS service with an autoscaling target and a couple of policies. Let's say I make a change that forces the recreation of the service/target: the autoscaling policy is still in the state file but it doesnt get recreated after recreating the ECS service and target. When I look in AWS, the servioce is there but the autoscaling policies and the target are just gone.

When I run terraform a second time, then they get recreated:

```
...
  # module.user-mgmt.aws_appautoscaling_policy.ecs_policy_down_cpu will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_down_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu-scale-down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Service_Finder_dptest/service-finder_dptest_user-mgmt"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.user-mgmt.aws_appautoscaling_policy.ecs_policy_up_cpu will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_up_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu-scale-up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Service_Finder_dptest/service-finder_dptest_user-mgmt"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.user-mgmt.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 20
      + min_capacity       = 2
      + resource_id        = "service/Service_Finder_dptest/service-finder_dptest_user-mgmt"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }
...
```
Any chance this could be looked into? Thanks!

My version:
```
$ terraform version
Terraform v0.12.4
+ provider.archive v1.2.2
+ provider.aws v2.19.0
+ provider.random v2.1.2
+ provider.template v2.1.2
+ provider.tls v2.0.1
```




